//saver
#include<iostream>
using namespace std;
int main()
{
    int n;
    cin>>n;
    //брой пакети, стекове,кутии
    int brp=0,brs=0,brk=0,och;
    //1.проверяваме дали въобще могат да се купят кутии
    if(n>=320)
    {
                 brk=n/320;
                 och=n%320;
                 brs=och/8;
                 //2. проверяваме дали броя на стековете  се е получил 0
                 //ако това е така, то остатъка ще даде броя на пакетите, а стековете ще си останат 0
                 if(brs==0){brp=och;}                                       
                             
    } 
    //ако не могат да се купят кутии, дали е възможно да се купят стекове                        
    if(n>=8&&n<320){
                          brs=n/8;
                          brp=n%8;
                          }
    //ако не е възможно да се купят нито кутии, нито стекове                      
    if(n<8){
             brp=n;
             }                      
    
    cout<<brk<<" "<<brs<<" "<<brp<<endl;
    system("pause");
    return 0;
}
