#include <iostream>
using namespace std;
int  main()
{int a[11]={0},n,r,k, q=0,br,i,j;
   cin>>n;
  for (i=0;i<n;i++)
  {cin>>r; 
   if (r>9)a[2*(r/10)-1]++; //броене на различните елементи
   else a[2*r]++;   }
  if ((a[2]>0)+(a[4]>0)+(a[10]>0)== 0)cout<<"No";
  else 
   {k=2;
     for (i=1;i<6;i+=2) //търсене на най-дълъг среден елемент
       {if (a[k]%2 !=0 ) {q=k;break;}
         k+=i*2;       }
     if (q==2) br=(a[2]==1)? a[1]:a[1]%2;
     else  if (q!=0 && (a[4]>1 || a[10]>1)) br=1;
             else 
if (a[1]%2!=0 && a[2]>0) 
{ q=2; br= (a[2]==2)? a[1]: a[1]%2;}
    k=1; int s;
    for (i=1;i<6;i+=2) //извеждане на половината палиндром
     { s=(a[k+1]-(k+1==q))/2;
       for (j=0;j<a[k]/2;j++)
          if (s>0) cout<<(k+1)/2*10;
       //десетки се извеждат само при наличие на единица
        for (j=0;j<s;j++)  //оставаме 1 единичен за средния елемент
         cout<<(k+1)/2;
       k+=i*2;
      }
    //извеждане на средния елемент
     if (q==2) for (i=0;i<br;i++)    cout<<q/2*10;
     if (q!=0)cout<<q/2;
     k=10;
    for ( i=3;i>-2;i-=2) //извеждане на другата половина на палиндрома
     { s=(a[k]-(q==k))/2;
       for (j=0;j<(s-(a[k-1]>0));j++)     cout<<k/2;
	   if (s>0 &&  k==2 && a[k-1]>0)
               { for ( j=0;j<(a[k-1]/2);j++) cout<<k/2*10;
                //десетки се извеждат само при наличие на единица
		       cout<<k/2;
                }
       k-=i*2;
       }
     }  
  return 0;
}  
